### Collection Function

<pre>
<a href = "https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/README.md">DOCS</a>
    â”œâ”€â”€ <a href = "https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/00_Terraform/README.md">Terraform</a>
    â”œâ”€â”€ <a href = "https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/01_Configuration_Language/README.md">Configuration Language</a>
    â”œâ”€â”€ <a href ="https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/02_Commands(CLI)/README.md">Commands(CLI)</a>
    â”œâ”€â”€ <a href = "https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/03_Providers/README.md">Providers</a>
    â”œâ”€â”€ <a href = "https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/04_Provisioners/README.md">Provisioners</a>
    â”œâ”€â”€ <a href = "https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/05_Modules/README.md">Modules</a>
    â”œâ”€â”€ <a href = "https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/06_State/README.md">State</a>
    â”œâ”€â”€ <a href = "https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/07_Backends/README.md">Backends</a>
    â””â”€â”€ <a href="https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/README.md">Functions</a>
                â”œâ”€â”€ <a href ="https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/01_Numeric_Functions/README.md">Numeric_Functions</a>
                â”œâ”€â”€ <a href ="https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/02_String_Functions/README.md">String_Functions</a>
                â”œâ”€â”€ <a href ="https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/03_Collection_Functions/README.md"><i><b>Collection_Functions</b></i></a>
                â”œâ”€â”€ <a href ="https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/04_Encoding_Functions/README.md">Encoding_Functions</a>
                â”œâ”€â”€ <a href ="https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/05_Filesystem_Functions/README.md">Filesystem_Functions</a>
                â”œâ”€â”€ <a href ="https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/06_Date_and_Time_Functions/README.md">Date_and_Time_Functions</a>
                â”œâ”€â”€ <a href ="https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/07_Hash_and_Crypto_Functions/README.md">Hash_and_Time_Functions</a>
                â”œâ”€â”€ <a href ="https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/08_IP_Network_Functions/README.md">IP_Network_Functions</a>
                â””â”€â”€ <a href ="https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/09_Type_Conversion_Functions/README.md">Type_Conversion_Functions</a>
</pre>

---

#### alltrue Function

alltrueëŠ” ì£¼ì–´ì§„ ì§‘í•©ì˜ ëª¨ë“  ìš”ì†Œê°€ trueì´ê±°ë‚˜ "true"ì¸ ê²½ìš° trueë¥¼ ë°˜í™˜í•©ë‹ˆë‹¤. ë˜í•œ ì»¬ë ‰ì…˜ì´ ë¹„ì–´ ìˆìœ¼ë©´ trueë¥¼ ë°˜í™˜í•©ë‹ˆë‹¤.

```
alltrue(list)
```

##### Examples

```
> alltrue(["true", true])
true
> alltrue([true, false])
false
```

#### anytrue Function

anytrueëŠ” ì£¼ì–´ì§„ ì§‘í•©ì˜ ìš”ì†Œê°€ trueì´ê±°ë‚˜ "true"ì´ë©´ trueë¥¼ ë°˜í™˜í•©ë‹ˆë‹¤. ë˜í•œ ì»¬ë ‰ì…˜ì´ ë¹„ì–´ ìˆìœ¼ë©´ falseë¥¼ ë°˜í™˜í•©ë‹ˆë‹¤.

```
anytrue(list)
```

##### Examples

```
> anytrue(["true"])
true
> anytrue([true])
true
> anytrue([true, false])
true
> anytrue([])
false
```

#### chunklist Function

chunklistëŠ” ë‹¨ì¼ ëª©ë¡ì„ ê³ ì • í¬ê¸° ì²­í¬ë¡œ ë¶„í• í•˜ì—¬ ëª©ë¡ì„ ë°˜í™˜í•©ë‹ˆë‹¤.

```
chunklist(list, chunk_size)
```

##### Examples

```
> chunklist(["a", "b", "c", "d", "e"], 2)
[
  [
    "a",
    "b",
  ],
  [
    "c",
    "d",
  ],
  [
    "e",
  ],
]
> chunklist(["a", "b", "c", "d", "e"], 1)
[
  [
    "a",
  ],
  [
    "b",
  ],
  [
    "c",
  ],
  [
    "d",
  ],
  [
    "e",
  ],
]
```

#### coalesce Function

coalesceì€ ì„ì˜ì˜ ìˆ˜ì˜ ì¸ìˆ˜ë¥¼ ì‚¬ìš©í•˜ê³  null ë˜ëŠ” ë¹ˆ ë¬¸ìì—´ì´ ì•„ë‹Œ ì²« ë²ˆì§¸ ì¸ìˆ˜ë¥¼ ë°˜í™˜í•©ë‹ˆë‹¤.

ëª¨ë“  ì¸ìˆ˜ëŠ” ë™ì¼í•œ ìœ í˜•ì´ì–´ì•¼ í•©ë‹ˆë‹¤. í…Œë¼í¼ì€ ì¼ì¹˜í•˜ì§€ ì•ŠëŠ” ì¸ìˆ˜ë¥¼ ëª¨ë“  ì¸ìˆ˜ê°€ ë³€í™˜í•  ìˆ˜ ìˆëŠ” ê°€ì¥ ì¼ë°˜ì ì¸ í˜•ì‹ìœ¼ë¡œ ë³€í™˜í•˜ê±°ë‚˜, ìœ í˜•ì´ í˜¸í™˜ë˜ì§€ ì•Šìœ¼ë©´ ì˜¤ë¥˜ë¥¼ ë°˜í™˜í•œë‹¤. ê²°ê³¼ ìœ í˜•ì€ ëª¨ë“  ì¸ìˆ˜ì˜ ìœ í˜•ê³¼ ë™ì¼í•©ë‹ˆë‹¤.

##### Examples

```
> coalesce("a", "b")
a
> coalesce("", "b")
b
> coalesce(1,2)
1
```

ë¬¸ìì—´ ëª©ë¡ì„ ì‚¬ìš©í•˜ì—¬ ë³‘í•© ì‘ì—…ì„ ìˆ˜í–‰í•˜ë ¤ë©´ ... ê¸°í˜¸ë¥¼ ì‚¬ìš©í•˜ì—¬ ëª©ë¡ì„ ì¸ìˆ˜ë¡œ í™•ì¥í•˜ì‹­ì‹œì˜¤.

```
> coalesce(["", "b"]...)
b
```

í…Œë¼í¼ì€ ëª¨ë“  ì¸ìˆ˜ê°€ ë³€í™˜í•  ìˆ˜ ìˆëŠ” ê²°ê³¼ ìœ í˜•ì„ ì„ íƒí•˜ë ¤ê³  ì‹œë„í•˜ë¯€ë¡œ, ì¸ìˆ˜ ìœ í˜•ì„ í˜¼í•©í•˜ë©´ í…Œë¼í¼ì˜ ìë™ ìœ í˜• ë³€í™˜ ê·œì¹™ìœ¼ë¡œ ì¸í•´ ë‹¤ìŒê³¼ ê°™ì€ ë†€ë¼ìš´ ê²°ê³¼ë¥¼ ì–»ì„ ìˆ˜ ìˆë‹¤.

```
> coalesce(1, "hello")
"1"
> coalesce(true, "hello")
"true"
> coalesce({}, "hello")
Error: Error in function call
Call to function "coalesce" failed: all arguments must have the same type.
```

#### ##### Related Functions

- coalescelistëŠ” ê°œë³„ ì¸ìˆ˜ê°€ ì•„ë‹Œ ëª©ë¡ ì¸ìˆ˜ë¡œ ìœ ì‚¬í•œ ì—°ì‚°ì„ ìˆ˜í–‰í•©ë‹ˆë‹¤.

#### coalescelist Function

coalescelistëŠ” ì„ì˜ì˜ ìˆ˜ì˜ ëª©ë¡ ì¸ìˆ˜ë¥¼ ì‚¬ìš©í•˜ê³  ë¹„ì–´ ìˆì§€ ì•Šì€ ì²« ë²ˆì§¸ ì¸ìˆ˜ë¥¼ ë°˜í™˜í•©ë‹ˆë‹¤.

##### Examples

```
> coalescelist(["a", "b"], ["c", "d"])
[
  "a",
  "b",
]
> coalescelist([], ["c", "d"])
[
  "c",
  "d",
]
```

listsì˜ ëª©ë¡ì„ ì‚¬ìš©í•˜ì—¬ ë³‘í•© ì‘ì—…ì„ ìˆ˜í–‰í•˜ë ¤ë©´ ... ê¸°í˜¸ë¥¼ ì‚¬ìš©í•˜ì—¬ ì™¸ë¶€ ëª©ë¡ì„ ì¸ìˆ˜ë¡œ í™•ì¥í•˜ì‹­ì‹œì˜¤.

```
> coalescelist([[], ["c", "d"]]...)
[
  "c",
  "d",
]
```

##### Related Functions

- collesceëŠ” list ì¸ìˆ˜ê°€ ì•„ë‹Œ string ì¸ìˆ˜ë¡œ ìœ ì‚¬í•œ ì‘ì—…ì„ ìˆ˜í–‰í•©ë‹ˆë‹¤.

#### compact Function

compactëŠ” ë¬¸ìì—´ ëª©ë¡ì„ ê°€ì ¸ì™€ì„œ ë¹ˆ ë¬¸ìì—´ ìš”ì†Œê°€ ì œê±°ëœ ìƒˆ ëª©ë¡ì„ ë°˜í™˜í•©ë‹ˆë‹¤.

##### Examples

```
> compact(["a", "", "b", "c"])
[
  "a",
  "b",
  "c",
]
```

#### concat Function

concatì€ ë‘ ê°œ ì´ìƒì˜ ëª©ë¡ì„ ê°€ì ¸ì™€ì„œ í•˜ë‚˜ì˜ ëª©ë¡ìœ¼ë¡œ ê²°í•©í•©ë‹ˆë‹¤.

##### Examples

```
> concat(["a", ""], ["b", "c"])
[
  "a",
  "",
  "b",
  "c",
]
```

#### contains Function

containsëŠ” ì§€ì •ëœ ëª©ë¡ ë˜ëŠ” ì§‘í•©ì´ ì§€ì •ëœ ë‹¨ì¼ ê°’ì„ í•´ë‹¹ ìš”ì†Œ ì¤‘ í•˜ë‚˜ë¡œ í¬í•¨í•˜ëŠ”ì§€ ì—¬ë¶€ë¥¼ ê²°ì •í•©ë‹ˆë‹¤.

```
contains(list, value)
```

##### Examples

```
> contains(["a", "b", "c"], "a")
true
> contains(["a", "b", "c"], "d")
false
```

#### distinct Function

distinctëŠ” ëª©ë¡ì„ ê°€ì ¸ì™€ì„œ ì¤‘ë³µ ìš”ì†Œê°€ ì œê±°ëœ ìƒˆ ëª©ë¡ì„ ë°˜í™˜í•©ë‹ˆë‹¤.

ê° ê°’ì˜ ì²« ë²ˆì§¸ ë°œìƒì´ ìœ ì§€ë˜ê³  ì´ëŸ¬í•œ ìš”ì†Œì˜ ìƒëŒ€ì  ìˆœì„œê°€ ìœ ì§€ë©ë‹ˆë‹¤.

##### Examples

```
> distinct(["a", "b", "a", "c", "d", "b"])
[
  "a",
  "b",
  "c",
  "d",
]
```

#### element Function

elementëŠ” ëª©ë¡ì—ì„œ ë‹¨ì¼ ìš”ì†Œë¥¼ ê²€ìƒ‰í•©ë‹ˆë‹¤.

```
element(list, index)
```

ì¸ë±ìŠ¤ëŠ” 0ì„ ê¸°ë°˜ìœ¼ë¡œ í•©ë‹ˆë‹¤. ì´ í•¨ìˆ˜ë¥¼ ë¹ˆ ëª©ë¡ê³¼ í•¨ê»˜ ì‚¬ìš©í•˜ë©´ ì˜¤ë¥˜ê°€ ë°œìƒí•©ë‹ˆë‹¤. ì¸ë±ìŠ¤ëŠ” ìŒìˆ˜ê°€ ì•„ë‹Œ ì •ìˆ˜ì—¬ì•¼ í•©ë‹ˆë‹¤.

ëŒ€ë¶€ë¶„ì˜ ê²½ìš° ê¸°ë³¸ ì œê³µ ì¸ë±ìŠ¤ êµ¬ë¬¸ ëª©ë¡ì„ ì‚¬ìš©í•©ë‹ˆë‹¤. ì´ ê¸°ëŠ¥ì€ ì•„ë˜ì— ì„¤ëª…ëœ íŠ¹ë³„í•œ ì¶”ê°€ "wrap-around" ë™ì‘ì—ë§Œ ì‚¬ìš©í•˜ì‹­ì‹œì˜¤.

##### Examples

```
> element(["a", "b", "c"], 1)
b
```

ì§€ì •ëœ ì¸ë±ìŠ¤ê°€ ëª©ë¡ì˜ ê¸¸ì´ë³´ë‹¤ í¬ë©´ ì¸ë±ìŠ¤ ëª¨ë“ˆì„ ì‚¬ìš©í•˜ì—¬ ì¸ë±ìŠ¤ë¥¼ "wrapped around"í•©ë‹ˆë‹¤.

```
> element(["a", "b", "c"], 3)
a
```

ëª©ë¡ì—ì„œ ë§ˆì§€ë§‰ ìš”ì†Œë¥¼ ê°€ì ¸ì˜¤ë ¤ë©´ ê¸¸ì´ë¥¼ ì‚¬ìš©í•˜ì—¬ ëª©ë¡ì˜ í¬ê¸°(ëª©ë¡ì´ zero-basedì¸ ê²½ìš° 1ì„ ëº€ ê°’)ë¥¼ ì°¾ì€ ë‹¤ìŒ ë§ˆì§€ë§‰ ìš”ì†Œë¥¼ ì„ íƒí•©ë‹ˆë‹¤.

```
> element(["a", "b", "c"], length(["a", "b", "c"])-1)
c
```

##### Related Functions

- indexëŠ” íŠ¹ì • ìš”ì†Œ ê°’ì— ëŒ€í•œ ì¸ë±ìŠ¤ë¥¼ ì°¾ìŠµë‹ˆë‹¤.
- lookupì€ mapì—ì„œ í‚¤ë¥¼ ì§€ì •í•˜ë©´ ê°’ì„ ê²€ìƒ‰í•©ë‹ˆë‹¤.

#### flatten Function

flatì€ ëª©ë¡ì„ ê°€ì ¸ì™€ì„œ ëª©ë¡ì¸ ìš”ì†Œë¥¼ ëª©ë¡ ë‚´ìš©ì˜ í‰í‰í•œ ì‹œí€€ìŠ¤ë¡œ ë°”ê¿‰ë‹ˆë‹¤.

##### Examples

```
> flatten([["a", "b"], [], ["c"]])
["a", "b", "c"]
```

ì¤‘ì²© ë¦¬ìŠ¤íŠ¸ ì¤‘ í•˜ë‚˜ë¼ë„ ì§ì ‘ ì¤‘ì²©ëœ ë¦¬ìŠ¤íŠ¸ë¥¼ í¬í•¨í•˜ëŠ” ê²½ìš°, ì´ë“¤ ì—­ì‹œ ì¬ê·€ì ìœ¼ë¡œ flattenëœë‹¤.

```
> flatten([[["a", "b"], []], ["c"]])
["a", "b", "c"]
```

ë§µì˜ ëª©ë¡ê³¼ ê°™ì´ ê°„ì ‘ì ìœ¼ë¡œ ì¤‘ì²©ëœ ëª©ë¡ì€ flattení•˜ì§€ ì•ŠìŠµë‹ˆë‹¤.

##### Flattening nested structures for for_each

ë¦¬ì†ŒìŠ¤ for_eachì™€ dynamic block ì–¸ì–´ ê¸°ëŠ¥ ëª¨ë‘ ê° ë°˜ë³µ ì§€ì ë§ˆë‹¤ í•˜ë‚˜ì˜ elementë¥¼ ê°–ëŠ” collection valueê°€ í•„ìš”í•˜ë‹¤.

ë•Œë•Œë¡œ ë‹¹ì‹ ì˜ ì…ë ¥ ë°ì´í„° êµ¬ì¡°ê°€ ìì—°ìŠ¤ëŸ½ê²Œ for_each ì¸ìˆ˜ì— ì‚¬ìš©í•˜ê¸°ì— ì í•©í•œ ëª¨ì–‘ì´ ì•„ë‹ˆë©° flattenì€ ì¤‘ì²©ëœ ë°ì´í„° êµ¬ì¡°ë¥¼ í”Œë« êµ¬ì¡°ë¡œ ì¶•ì†Œí•  ë•Œ ìœ ìš©í•œ ë„ìš°ë¯¸ í•¨ìˆ˜ê°€ ë  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

ì˜ˆë¥¼ ë“¤ì–´ ë‹¤ìŒê³¼ ê°™ì€ ë³€ìˆ˜ë¥¼ ì„ ì–¸í•˜ëŠ” ëª¨ë“ˆì„ ìƒê°í•´ ë³´ì‹­ì‹œì˜¤.

```
variable "networks" {
  type = map(object({
    cidr_block = string
    subnets    = map(object({ cidr_block = string }))
  }))
}
```

ìœ„ì˜ ë°©ë²•ì€ ìµœìƒìœ„ ë„¤íŠ¸ì›Œí¬ ë° í•´ë‹¹ ì„œë¸Œë„·ê³¼ ê°™ì´ íŠ¸ë¦¬ë¥¼ ìì—°ìŠ¤ëŸ½ê²Œ í˜•ì„±í•˜ëŠ” ê°ì²´ë¥¼ ëª¨ë¸ë§í•˜ëŠ” í•©ë¦¬ì ì¸ ë°©ë²•ì´ë‹¤. ìµœìƒìœ„ ë„¤íŠ¸ì›Œí¬ì˜ ë°˜ë³µì€ ì´ ë³€ìˆ˜ë¥¼ ì§ì ‘ ì‚¬ìš©í•  ìˆ˜ ìˆëŠ”ë°, ì´ëŠ” ì´ë¯¸ ê²°ê³¼ ì¸ìŠ¤í„´ìŠ¤ê°€ ë§µ ìš”ì†Œì™€ ì¼ëŒ€ì¼ ì¼ì¹˜í•˜ê¸° ë•Œë¬¸ì…ë‹ˆë‹¤.

```
resource "aws_vpc" "example" {
  for_each = var.networks
  cidr_block = each.value.cidr_block
}
```

ê·¸ëŸ¬ë‚˜ ëª¨ë“  ì„œë¸Œë„·ì„ ë‹¨ì¼ ë¦¬ì†ŒìŠ¤ ë¸”ë¡ìœ¼ë¡œ ì„ ì–¸í•˜ë ¤ë©´ ë¨¼ì € êµ¬ì¡°ë¥¼ í‰í‰í•˜ê²Œ í•˜ì—¬ ê° ìµœìƒìœ„ ìš”ì†Œê°€ ë‹¨ì¼ ì„œë¸Œë„·ì„ ë‚˜íƒ€ë‚´ëŠ” ì»¬ë ‰ì…˜ì„ ìƒì„±í•´ì•¼ í•©ë‹ˆë‹¤.

```
locals {
  # flatten ensures that this local value is a flat list of objects, rather
  # than a list of lists of objects.
  network_subnets = flatten([
    for network_key, network in var.networks : [
      for subnet_key, subnet in network.subnets : {
        network_key = network_key
        subnet_key  = subnet_key
        network_id  = aws_vpc.example[network_key].id
        cidr_block  = subnet.cidr_block
      }
    ]
  ])
}
resource "aws_subnet" "example" {
  # local.network_subnets is a list, so we must now project it into a map
  # where each key is unique. We'll combine the network and subnet keys to
  # produce a single unique key per instance.
  for_each = {
    for subnet in local.network_subnets : "${subnet.network_key}.${subnet.subnet_key}" => subnet
  }
  vpc_id            = each.value.network_id
  availability_zone = each.value.subnet_key
  cidr_block        = each.value.cidr_block
}
```

ìœ„ì˜ ê²°ê³¼ëŠ” ì„œë¸Œë„· ê°œì²´ë‹¹ í•˜ë‚˜ì˜ ì„œë¸Œë„· ì¸ìŠ¤í„´ìŠ¤ë¥¼ ìƒì„±í•˜ëŠ” ë™ì‹œì— ì„œë¸Œë„·ê³¼ í¬í•¨ëœ ë„¤íŠ¸ì›Œí¬ ê°„ì˜ ì—°ê²°ì„ ìœ ì§€í•©ë‹ˆë‹¤.

##### Related Functions

- setproductëŠ” ì—¬ëŸ¬ ëª©ë¡ ë˜ëŠ” ê°’ ì§‘í•©ì˜ ëª¨ë“  ì¡°í•©ì„ ì°¾ìœ¼ë©°, ì´ëŠ” for_each constructsì™€ í•¨ê»˜ ì‚¬ìš©í•  ì»¬ë ‰ì…˜ì„ ì¤€ë¹„í•  ë•Œë„ ìœ ìš©í•©ë‹ˆë‹¤.

#### index Function

indexëŠ” ëª©ë¡ì—ì„œ ì§€ì •ëœ ê°’ì— ëŒ€í•œ ìš”ì†Œ ì¸ë±ìŠ¤ë¥¼ ì°¾ìŠµë‹ˆë‹¤.

```
index(list, value)
```

ë°˜í™˜ëœ ì¸ë±ìŠ¤ëŠ” zero base ì…ë‹ˆë‹¤. ì´ í•¨ìˆ˜ëŠ” ì§€ì •ëœ ê°’ì´ ëª©ë¡ì— ì—†ìœ¼ë©´ ì˜¤ë¥˜ë¥¼ ìƒì„±í•©ë‹ˆë‹¤.

##### Examples

```
> index(["a", "b", "c"], "b")
1
```

##### Related Functions

- elementëŠ” í•´ë‹¹ ì¸ë±ìŠ¤ê°€ ì§€ì •ëœ ëª©ë¡ì—ì„œ íŠ¹ì • ìš”ì†Œë¥¼ ê²€ìƒ‰í•©ë‹ˆë‹¤.

#### keys Function

keysëŠ” ë§µì„ ê°€ì ¸ì™€ì„œ í•´ë‹¹ ë§µì˜ í‚¤ë¥¼ í¬í•¨í•˜ëŠ” ëª©ë¡ì„ ë°˜í™˜í•©ë‹ˆë‹¤.

keyëŠ” ì‚¬ì „ìˆœìœ¼ë¡œ ë°˜í™˜ë˜ë¯€ë¡œ ë§µì˜ í‚¤ê°€ ë³€ê²½ë˜ì§€ ì•ŠëŠ” í•œ ê²°ê³¼ëŠ” ë™ì¼í•©ë‹ˆë‹¤.

##### Examples

```
> keys({a=1, c=2, d=3})
[
  "a",
  "c",
  "d",
]
```

##### Related Functions

- valuesëŠ” ë§µì—ì„œ ê°’ ëª©ë¡ì„ ë°˜í™˜í•©ë‹ˆë‹¤.

#### length Functions

lengthëŠ” ì§€ì •ëœ ëª©ë¡, ë§µ ë˜ëŠ” ë¬¸ìì—´ì˜ ê¸¸ì´ë¥¼ ê²°ì •í•©ë‹ˆë‹¤.

ëª©ë¡ì´ë‚˜ ë§µì´ ì£¼ì–´ì§„ ê²½ìš° ê²°ê³¼ëŠ” í•´ë‹¹ ì»¬ë ‰ì…˜ì˜ ìš”ì†Œ ìˆ˜ì…ë‹ˆë‹¤. ë¬¸ìì—´ì„ ì§€ì •í•˜ë©´ ë¬¸ìì—´ì˜ ë¬¸ì ìˆ˜ê°€ ë©ë‹ˆë‹¤.

##### Examples

```
> length([])
0
> length(["a", "b"])
2
> length({"a" = "b"})
1
> length("hello")
5
```

ë¬¸ìì—´ì´ ì£¼ì–´ì¡Œì„ ë•Œ, ê·¸ ê²°ê³¼ëŠ” ë°”ì´íŠ¸ë‚˜ ìœ ë‹ˆì½”ë“œ ì‹œí€€ìŠ¤ì˜ ìˆ˜ê°€ ì•„ë‹ˆë¼ ë¬¸ìì˜ ìˆ˜ì´ë‹¤:

```
> length("ğŸ‘¾ğŸ•¹ï¸")
2
```

"ë¬¸ì(character)"ëŠ” ìœ ë‹ˆì½”ë“œ í‘œì¤€ ë¶€ì†ì„œ 29ë²ˆì—ì„œ ì •ì˜í•œ ëŒ€ë¡œ, í•˜ë‚˜ì˜ ë¬¸ì í´ëŸ¬ìŠ¤í„°ì´ë‹¤. í…Œë¼í¼ ì œê³µìëŠ” í…Œë¼í¼ì˜ ë¬¸ìì—´ í‘œí˜„ì„ ê°ê°ì˜ ì›ê²© ì‹œìŠ¤í…œì—ì„œ ì‚¬ìš©í•˜ëŠ” ë¬¸ìì—´ í‘œí˜„ìœ¼ë¡œ ë³€í™˜í•˜ê³  ì¶”ê°€ ê²€ì¦ ê·œì¹™ì„ ì ìš©í•  ì±…ì„ì´ ìˆë‹¤.

#### list Function

list í•¨ìˆ˜ëŠ” ë” ì´ìƒ ì‚¬ìš©í•  ìˆ˜ ì—†ìŠµë‹ˆë‹¤. í…Œë¼í¼ v0.12 ì´ì „ì—ëŠ” ì‹ ì•ˆì— literal ëª©ë¡ì„ ì‘ì„±í•  ìˆ˜ ìˆëŠ” ìœ ì¼í•œ êµ¬ë¬¸ì´ì—ˆì§€ë§Œ í…Œë¼í¼ v0.12ëŠ” ìƒˆë¡œìš´ 1ê¸‰ êµ¬ë¬¸ì„ ë„ì…í–ˆë‹¤.

list(a, b, c)ê³¼ ê°™ì€ ì‹ì„ ì—…ë°ì´íŠ¸í•˜ë ¤ë©´ ëŒ€ì‹  ë‹¤ìŒì„ ì…ë ¥í•˜ì‹­ì‹œì˜¤.

```
tolist([a, b, c])
```

[...] ê´„í˜¸ëŠ” íŠœí”Œ ê°’ì„ ìƒì„±í•œ ë‹¤ìŒ tolist í•¨ìˆ˜ê°€ ì´ë¥¼ ëª©ë¡ìœ¼ë¡œ ë³€í™˜í•©ë‹ˆë‹¤. í…Œë¼í¼ ì–¸ì–´ì˜ ê°’ ìœ í˜•ì— ëŒ€í•œ ìì„¸í•œ ë‚´ìš©ì€ Type Constraintsì„ ì°¸ì¡°í•˜ì‹­ì‹œì˜¤.

##### Related Functions

- concatì€ ë‹¤ë¥¸ ëª©ë¡ì˜ ìš”ì†Œë¥¼ í•¨ê»˜ ì—°ê²°í•˜ì—¬ ìƒˆ ëª©ë¡ì„ ìƒì„±í•©ë‹ˆë‹¤.
- tolistëŠ” ì„¸íŠ¸ ë˜ëŠ” íŠœí”Œ ê°’ì„ ëª©ë¡ìœ¼ë¡œ ë³€í™˜í•©ë‹ˆë‹¤.

#### lookup Function

lookupì€ í‚¤ê°€ ì§€ì •ëœ ë§µì—ì„œ ë‹¨ì¼ ìš”ì†Œì˜ ê°’ì„ ê²€ìƒ‰í•©ë‹ˆë‹¤. ì§€ì •ëœ í‚¤ê°€ ì—†ìœ¼ë©´ ì§€ì •ëœ default valueê°€ ëŒ€ì‹  ë°˜í™˜ë©ë‹ˆë‹¤.

```
lookup(map, key, default)
```

ê³¼ê±°ì˜ ì´ìœ ë¡œ ì¸í•´ ê¸°ë³¸ ë§¤ê°œ ë³€ìˆ˜ëŠ” ì‹¤ì œë¡œ ì„ íƒ ì‚¬í•­ì…ë‹ˆë‹¤. ê·¸ëŸ¬ë‚˜ ê¸°ë³¸ ìƒëµì€ ê¸°ë³¸ ì¸ë±ìŠ¤ êµ¬ë¬¸ì¸ map[key]ê³¼ ë™ì¼í•˜ê¸° ë•Œë¬¸ì— v0.7ë¶€í„°ëŠ” ë” ì´ìƒ ì‚¬ìš©ë˜ì§€ ì•ŠìŠµë‹ˆë‹¤.

##### Examples

```
> lookup({a="ay", b="bee"}, "a", "what?")
ay
> lookup({a="ay", b="bee"}, "c", "what?")
what?
```

##### Related Functions

- elementëŠ” í•´ë‹¹ ì¸ë±ìŠ¤ê°€ ì§€ì •ëœ ëª©ë¡ì—ì„œ ê°’ì„ ê²€ìƒ‰í•©ë‹ˆë‹¤.

#### map Function

map í•¨ìˆ˜ëŠ” ë” ì´ìƒ ì‚¬ìš©í•  ìˆ˜ ì—†ìŠµë‹ˆë‹¤. í…Œë¼í¼ v0.12 ì´ì „ì—ëŠ” ì‹ ì•ˆì— ë¦¬í„°ëŸ´ ë§µì„ ì“¸ ìˆ˜ ìˆëŠ” ìœ ì¼í•œ êµ¬ë¬¸ì´ì—ˆì§€ë§Œ í…Œë¼í¼ v0.12ëŠ” ìƒˆë¡œìš´ 1ê¸‰ êµ¬ë¬¸ì„ ë„ì…í–ˆë‹¤.

map("a", "b", "c", "d")ì™€ ê°™ì€ ì‹ì„ ì—…ë°ì´íŠ¸í•˜ë ¤ë©´, ëŒ€ì‹  ë‹¤ìŒì„ ì‘ì„±í•˜ì‹­ì‹œì˜¤.

```
tomap({
  a = "b"
  c = "d"
})
```

{ ... } ì¤‘ê´„í˜¸ë¡œ ê°ì²´ ê°’ì„ êµ¬ì„±í•œ ë‹¤ìŒ, tomap í•¨ìˆ˜ê°€ ì´ë¥¼ mapìœ¼ë¡œ ë³€í™˜í•©ë‹ˆë‹¤. í…Œë¼í¼ ì–¸ì–´ì˜ ê°’ ìœ í˜•ì— ëŒ€í•œ ìì„¸í•œ ë‚´ìš©ì€ Type Constraintsì„ ì°¸ì¡°í•˜ì‹­ì‹œì˜¤.

##### Related Functions

- tomapì€ ê°ì²´ ê°’ì„ mapìœ¼ë¡œ ë³€í™˜í•©ë‹ˆë‹¤.
- zipmapì€ í•œ ëª©ë¡ì—ì„œ í‚¤ì™€ ë‹¤ë¥¸ ëª©ë¡ì—ì„œ ê°’ì„ ê°€ì ¸ì™€ ë™ì ìœ¼ë¡œ mapì„ êµ¬ì„±í•©ë‹ˆë‹¤.

#### matchkeys Function

matchkeysëŠ” í•œ ëª©ë¡ì—ì„œ ì¸ë±ìŠ¤ê°€ ë‹¤ë¥¸ ëª©ë¡ì˜ í•´ë‹¹ ê°’ ì¸ë±ìŠ¤ì™€ ì¼ì¹˜í•˜ëŠ” ìš”ì†Œì˜ í•˜ìœ„ ì§‘í•©ì„ ì·¨í•˜ì—¬ ìƒˆ ëª©ë¡ì„ êµ¬ì„±í•©ë‹ˆë‹¤.

```
matchkeys(valueslist, keyslist, searchset)
```

matchkeysëŠ” keylistì—ì„œ searchsetì˜ ìš”ì†Œì™€ ë™ì¼í•œ ì¸ë±ìŠ¤ë¥¼ ì‹ë³„í•œ ë‹¤ìŒ valuelistì—ì„œ ë™ì¼í•œ ì¸ë±ìŠ¤ë¥¼ ê°€ì ¸ì™€ì„œ ìƒˆ ëª©ë¡ì„ êµ¬ì„±í•©ë‹ˆë‹¤. valuelistì™€ keylistëŠ” ëª¨ë‘ ê¸¸ì´ê°€ ê°™ì•„ì•¼ í•©ë‹ˆë‹¤.

ê°’ ëª©ë¡ì˜ ê°’ ìˆœì„œê°€ ê²°ê³¼ì— ìœ ì§€ë©ë‹ˆë‹¤.

##### Examples

```
> matchkeys(["i-123", "i-abc", "i-def"], ["us-west", "us-east", "us-east"], ["us-east"])
[
  "i-abc",
  "i-def",
]
```

ê²°ê³¼ ìˆœì„œê°€ ìœ ì˜í•˜ì§€ ì•Šì€ ê²½ìš° for expressionê³¼ mapì„ ì‚¬ìš©í•˜ì—¬ ìœ ì‚¬í•œ ê²°ê³¼ë¥¼ ì–»ì„ ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```
> [for i, z in {"i-123"="us-west","i-abc"="us-east","i-def"="us-east"}: i if z == "us-east"]
[
  "i-def",
  "i-abc",
]
```

ê´€ì‹¬ ìˆëŠ” í‚¤ì™€ ê°’ì´ ê°œì²´ ëª©ë¡ì— ìˆëŠ” ê°œì²´ì˜ íŠ¹ì„±ì¸ ê²½ìš° í•´ë‹¹ ëª©ë¡ì˜ for expressionì„ ì‚¬ìš©í•˜ì—¬ ìœ ì‚¬í•œ ê²°ê³¼ë¥¼ ì–»ì„ ìˆ˜ë„ ìˆìŠµë‹ˆë‹¤.

```
> [for x in [{id="i-123",zone="us-west"},{id="i-abc",zone="us-east"}]: x.id if x.zone == "us-east"]
[
  "i-abc",
]
```

ì˜ˆë¥¼ ë“¤ì–´ count meta-attribute setê°€ í¬í•¨ëœ resource ë¸”ë¡ì—ì„œ ìƒì„±ëœ ë¦¬ì†ŒìŠ¤ ì¸ìŠ¤í„´ìŠ¤ ëª©ë¡ê³¼ í•¨ê»˜ ì´ì „ ì–‘ì‹ì„ ì‚¬ìš©í•˜ì—¬ ë¦¬ì†ŒìŠ¤ ì†ì„± ì¤‘ í•˜ë‚˜ë¥¼ ì¼ì¹˜ì‹œì¼œ ì¸ìŠ¤í„´ìŠ¤ë¥¼ í•„í„°ë§í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```
> [for x in aws_instance.example: x.id if x.availability_zone == "us-east-1a"]
[
  "i-abc123",
  "i-def456",
]
```

#### merge Function

mergeëŠ” ì„ì˜ì˜ ìˆ˜ì˜ ë§µ ë˜ëŠ” ê°œì²´ë¥¼ ì‚¬ìš©í•˜ë©° ëª¨ë“  ì¸ìˆ˜ì˜ ë³‘í•©ëœ ìš”ì†Œ ì§‘í•©ì„ í¬í•¨í•˜ëŠ” ë‹¨ì¼ ë§µ ë˜ëŠ” ê°œì²´ë¥¼ ë°˜í™˜í•©ë‹ˆë‹¤.

ë‘˜ ì´ìƒì˜ ì§€ì •ëœ ë§µ ë˜ëŠ” ê°ì²´ê°€ ë™ì¼í•œ í‚¤ ë˜ëŠ” ì†ì„±ì„ ì •ì˜í•˜ëŠ” ê²½ìš° ì¸ìˆ˜ ì‹œí€€ìŠ¤ì˜ ë’·ë¶€ë¶„ì´ ìš°ì„ í•©ë‹ˆë‹¤. ì¸ìˆ˜ ìœ í˜•ì´ ì¼ì¹˜í•˜ì§€ ì•Šìœ¼ë©´ ë³‘í•© ê·œì¹™ì´ ì ìš©ëœ í›„ ê²°ê³¼ ìœ í˜•ì´ íŠ¹ì„±ì˜ ìœ í˜• êµ¬ì¡°ì™€ ì¼ì¹˜í•˜ëŠ” ê°œì²´ê°€ ë©ë‹ˆë‹¤.

##### Examples

```
> merge({a="b", c="d"}, {e="f", c="z"})
{
  "a" = "b"
  "c" = "z"
  "e" = "f"
}
> merge({a="b"}, {a=[1,2], c="z"}, {d=3})
{
  "a" = [
    1,
    2,
  ]
  "c" = "z"
  "d" = 3
}
```

ë‹¤ìŒ ì˜ˆì œì—ì„œëŠ” expansion ê¸°í˜¸(...)ë¥¼ ì‚¬ìš©í•˜ì—¬ ê°’ì„ ë³„ë„ì˜ ì¸ìˆ˜ë¡œ ë³€í™˜í•©ë‹ˆë‹¤. ìì„¸í•œ ë‚´ìš©ì€ Expanding Function Argumentì„ ì°¸ì¡°í•˜ì‹­ì‹œì˜¤.

```
> merge([{a="b", c="d"}, {}, {e="f", c="z"}]...)
{
  "a" = "b"
  "c" = "z"
  "e" = "f"
}
```

#### one Function

oneì€ 0~1ê°œì˜ ìš”ì†Œë¡œ list, set ë˜ëŠ” tuple ê°’ì„ ì·¨í•œë‹¤. ì»¬ë ‰ì…˜ì´ ë¹„ì–´ ìˆìœ¼ë©´ nullì„ ë°˜í™˜í•©ë‹ˆë‹¤. ê·¸ë ‡ì§€ ì•Šìœ¼ë©´ ì²« ë²ˆì§¸ elementsë¥¼ ë°˜í™˜í•©ë‹ˆë‹¤. elementsê°€ ë‘ ê°œ ì´ìƒ ìˆìœ¼ë©´ ì˜¤ë¥˜ê°€ ë°˜í™˜ë©ë‹ˆë‹¤.

ì´ê²ƒì€ ëª¨ë“ˆ ì‘ì„±ìê°€ nullì¼ ìˆ˜ ìˆëŠ” ë‹¨ì¼ ê°’ì„ ë°˜í™˜í•˜ê¸°ë¥¼ ì›í•˜ëŠ”, ì¡°ê±´ í•­ëª©ì´ 0 ë˜ëŠ” 1 element listìœ¼ë¡œ í‘œí˜„ë˜ëŠ” ì¼ë°˜ì ì¸ ìƒí™©ì„ ìœ„í•´ ì˜ë„ëœ íŠ¹ìˆ˜ í•¨ìˆ˜ì´ë‹¤.

ì˜ˆ:

```
variable "include_ec2_instance" {
  type    = bool
  default = true
}
resource "aws_instance" "example" {
  count = var.include_ec2_instance ? 1 : 0
  # (other resource arguments...)
}
output "instance_ip_address" {
  value = one(aws_instance.example[*].private_ip)
}
```

ìœ„ì˜ aws_instance ë¦¬ì†ŒìŠ¤ì—ëŠ” 0 ë˜ëŠ” 1ì„ ë°˜í™˜í•˜ëŠ” ì¡°ê±´ìœ¼ë¡œ ì„¤ì •ëœ count ì¸ìˆ˜ê°€ ìˆê¸° ë•Œë¬¸ì— aws_instance.exampleì˜ ê°’ì€ 0 ë˜ëŠ” 1 elementì˜ ëª©ë¡ì…ë‹ˆë‹¤. instance_ip_address ì¶œë ¥ ê°’ì€ í•˜ë‚˜ì˜ í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•˜ì—¬ ë‹¨ì¼ ì¸ìŠ¤í„´ìŠ¤ì˜ ê°œì¸ IP ì£¼ì†Œë¥¼ ë°˜í™˜í•˜ê±°ë‚˜ ì¸ìŠ¤í„´ìŠ¤ê°€ ìƒì„±ë˜ì§€ ì•Šì€ ê²½ìš° nullì„ ë°˜í™˜í•©ë‹ˆë‹¤.

##### Relationship to the "Splat" Operator

í…Œë¼í¼ ì–¸ì–´ì—ëŠ” splat operatorë¡œ ì•Œë ¤ì§„ built-in ì—°ì‚°ì [*]ê°€ ìˆìœ¼ë©°, í•¨ìˆ˜ ì¤‘ í•˜ë‚˜ëŠ” nullì¼ ìˆ˜ ìˆëŠ” ì›ì‹œ ê°’ì„ 0 ~ 1ê°œì˜ element ëª©ë¡ìœ¼ë¡œ ë³€í™˜í•˜ëŠ” ê²ƒì´ë‹¤.

```
variable "ec2_instance_type" {
  description = "The type of instance to create. If set to null, no instance will be created."
  type    = string
  default = null
}
resource "aws_instance" "example" {
  count = length(var.ec2_instance_type[*])
  instance_type = var.ec2_instance_type
  # (other resource arguments...)
}
output "instance_ip_address" {
  value = one(aws_instance.example[*].private_ip)
}
```

ì´ ê²½ìš°, ìš°ë¦¬ëŠ” í•˜ë‚˜ì˜ í•¨ìˆ˜ê°€ ì–´ë–¤ ì˜ë¯¸ì—ì„œ [*]ë¥¼ ì›ì‹œ ìœ í˜• ê°’ì— ì ìš©í•˜ëŠ” ê²ƒê³¼ëŠ” ë°˜ëŒ€ë¼ëŠ” ê²ƒì„ ì•Œ ìˆ˜ ìˆë‹¤. ìŠ¤í”Œë«ì€ nullì¼ ê°€ëŠ¥ì„±ì´ ìˆëŠ” ê°’ì„ 0 ë˜ëŠ” 1 ëª©ë¡ìœ¼ë¡œ ë³€í™˜í•  ìˆ˜ ìˆìœ¼ë©°, ì´ë¥¼ ë°˜ëŒ€ë¡œ í•˜ì—¬ nullì¼ ìˆ˜ ìˆëŠ” ì›ì‹œ ê°’ìœ¼ë¡œ ë˜ëŒë¦´ ìˆ˜ ìˆë‹¤.

##### Examples

```
> one([])
null
> one(["hello"])
"hello"
> one(["hello", "goodbye"])
Error: Invalid function argument
Invalid value for "list" parameter: must be a list, set, or tuple value with
either zero or one elements.
```

##### Using one with sets

ë‹¨ì¼ í•¨ìˆ˜ëŠ” 0 ë˜ëŠ” 1ê°œì˜ ìš”ì†Œë§Œ ìˆëŠ” ì§‘í•©ì´ ìˆëŠ” ê²½ìš°ì— íŠ¹íˆ ìœ ìš©í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤. ì„¤ì • ê°’ì€ ì¸ë±ì‹±ì„ ì§€ì›í•˜ì§€ ì•Šìœ¼ë¯€ë¡œ varë¥¼ ì“°ëŠ” ê²ƒì€ ìœ íš¨í•˜ì§€ ì•ŠìŠµë‹ˆë‹¤.set[0]ëŠ” ì§‘í•©ì˜ "ì²« ë²ˆì§¸" ìš”ì†Œë¥¼ ì¶”ì¶œí•˜ì§€ë§Œ í•­ëª©ì´ í•˜ë‚˜ë¿ì´ë¼ëŠ” ê²ƒì„ ì•Œë©´ í•´ë‹¹ ë‹¨ì¼ í•­ëª©ì„ ë¶„ë¦¬í•˜ì—¬ ë°˜í™˜í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```
> one(toset([]))
null
> one(toset(["hello"]))
"hello"
```

ë‘˜ ì´ìƒì˜ elementë¥¼ ê°€ì§ˆ ìˆ˜ ìˆëŠ” ì§‘í•©ê³¼ í•¨ê»˜ ì‚¬ìš©í•˜ì§€ ë§ˆì‹­ì‹œì˜¤. ì´ ê²½ìš° ì´ ê¸°ëŠ¥ì€ ì‹¤íŒ¨í•©ë‹ˆë‹¤.

```
> one(toset(["hello","goodbye"]))
Error: Invalid function argument
Invalid value for "list" parameter: must be a list, set, or tuple value with
either zero or one elements.
```

#### range Function

rangeëŠ” start value, limit value ë° step valueì„ ì‚¬ìš©í•˜ì—¬ ìˆ«ì ëª©ë¡ì„ ìƒì„±í•©ë‹ˆë‹¤.

```
range(max)
range(start, limit)
range(start, limit, step)
```

start ë° step ì¸ìˆ˜ëŠ” ìƒëµí•  ìˆ˜ ìˆìœ¼ë©°, ì´ ê²½ìš° startëŠ” 0ìœ¼ë¡œ, stepì€ startë³´ë‹¤ í¬ê±°ë‚˜ ì‘ì€ limitì— ë”°ë¼ 1 ë˜ëŠ” -1ë¡œ ê¸°ë³¸ ì„¤ì •ë©ë‹ˆë‹¤.

ê²°ê³¼ ëª©ë¡ì€ ì§€ì •ëœ start ê°’ìœ¼ë¡œ ì‹œì‘í•˜ê³  ê²°ê³¼ê°€ limit ì´ìƒì´ ë  ë•Œê¹Œì§€ stepì„ ë°˜ë³µì ìœ¼ë¡œ ì¶”ê°€í•˜ì—¬ ìƒì„±ë©ë‹ˆë‹¤.

limitì˜ í•´ì„ì€ stepì˜ directionì— ë”°ë¼ ë‹¬ë¼ì§„ë‹¤: ì–‘ìˆ˜ stepì˜ ê²½ìš°, ìˆœì„œëŠ” ë‹¤ìŒ ìˆ«ìê°€ limitë³´ë‹¤ í¬ê±°ë‚˜ ê°™ì„ ë•Œ ì™„ì„±ëœë‹¤. ìŒìˆ˜ stepì˜ ê²½ìš°, ì´ ê°’ì€ ë³´ë‹¤ ì‘ê±°ë‚˜ ê°™ì„ ë•Œ ì™„ë£Œë©ë‹ˆë‹¤.

ì‹œí€€ìŠ¤ ë¹Œë“œ ì•Œê³ ë¦¬ì¦˜ì€ ë‹¤ìŒê³¼ ê°™ì€ ìœ ì‚¬ ì½”ë“œë¥¼ ë”°ë¥¸ë‹¤.

```
let num = start
while num < limit: (or, for negative step, num > limit)
  append num to the sequence
  num = num + step
return the sequence
```

ì‹œí€€ìŠ¤ê°€ ë©”ëª¨ë¦¬ì˜ ë¬¼ë¦¬ì  ëª©ë¡ìœ¼ë¡œ ìƒì„±ë˜ê¸° ë•Œë¬¸ì— í…Œë¼í¼ì€ ì˜ˆë¥¼ ë“¤ì–´ ë§¤ìš° í° ê°’ì´ ì‹¤ìˆ˜ë¡œ limitìœ¼ë¡œ ì „ë‹¬ë˜ê±°ë‚˜ ë§¤ìš° ì‘ì€ ê°’ì´ stepìœ¼ë¡œ ì „ë‹¬ë˜ëŠ” ê²½ìš°ë¥¼ ë°©ì§€í•˜ê¸° ìœ„í•´ ê²°ê³¼ ì‹œí€€ìŠ¤ë¥¼ ì¸ìœ„ì ìœ¼ë¡œ 1024ê°œì˜ ìˆ«ìë¡œ ì œí•œí•œë‹¤. ìœ„ì˜ ì•Œê³ ë¦¬ì¦˜ì´ 1025ë²ˆì§¸ ìˆ«ìë¥¼ ì‹œí€€ìŠ¤ì— ì¶”ê°€í•˜ë©´ í•¨ìˆ˜ëŠ” ì¦‰ì‹œ ì˜¤ë¥˜ì™€ í•¨ê»˜ ì¢…ë£Œë©ë‹ˆë‹¤.

ê°€ëŠ¥í•œ ê²½ìš° rangeë¥¼ ë§Œë“œëŠ” ëŒ€ì‹  ê¸°ì¡´ ì»¬ë ‰ì…˜ì— ëŒ€í•´ ë°˜ë³µí•˜ëŠ” ê²ƒì´ ì¢‹ìŠµë‹ˆë‹¤. ê·¸ëŸ¬ë‚˜ ì‘ì€ ìˆ«ì ì‹œí€€ìŠ¤ë¥¼ ë§Œë“œëŠ” ê²ƒì€ collection-multipulation í•¨ìˆ˜ì˜ ë‹¤ë¥¸ ì»¬ë ‰ì…˜ê³¼ ê²°í•©í•˜ê±°ë‚˜ for expressionì— ìœ ìš©í•  ìˆ˜ ìˆë‹¤.

##### Examples

```
> range(3)
[
  0,
  1,
  2,
]
> range(1, 4)
[
  1,
  2,
  3,
]
> range(1, 8, 2)
[
  1,
  3,
  5,
  7,
]
> range(1, 4, 0.5)
[
  1,
  1.5,
  2,
  2.5,
  3,
  3.5,
]
> range(4, 1)
[
  4,
  3,
  2,
]
> range(10, 5, -2)
[
  10,
  8,
  6,
]
```

range í•¨ìˆ˜ëŠ” íŠ¹ì • ìˆ˜ì˜ ì¸ìŠ¤í„´ìŠ¤ë¥¼ ìƒì„±í•˜ê¸° ìœ„í•´ ë‹¤ë¥¸ ì»¬ë ‰ì…˜ê³¼ ì‘ì—…í•  ë•Œ ì£¼ë¡œ ìœ ìš©í•©ë‹ˆë‹¤. ì˜ˆ:

```
variable "name_counts" {
  type    = map(number)
  default = {
    "foo" = 2
    "bar" = 4
  }
}
locals {
  expanded_names = {
    for name, count in var.name_counts : name => [
      for i in range(count) : format("%s%02d", name, i)
    ]
  }
}
output "expanded_names" {
  value = local.expanded_names
}
# Produces the following expanded_names value when run with the default
# "name_counts":
#
# {
#   "bar" = [
#     "bar00",
#     "bar01",
#     "bar02",
#     "bar03",
#   ]
#   "foo" = [
#     "foo00",
#     "foo01",
#   ]
# }
```

##### reverse Function

reverseëŠ” ì£¼ì–´ì§„ ìˆœì„œì™€ ë™ì¼í•œ ëª¨ë“  ìš”ì†Œë¥¼ ê°€ì§€ê³  ë™ì¼í•œ ê¸¸ì´ì˜ ì‹œí€€ìŠ¤ë¥¼ ì—­ìˆœìœ¼ë¡œ ìƒì„±í•œë‹¤.

##### Examples

```
> reverse([1, 2, 3])
[
  3,
  2,
  1,
]
```

##### Related Functions

- streverëŠ” ë¬¸ìì—´ì„ ë’¤ì§‘ëŠ”ë‹¤.

#### setintersection Function

setintersection í•¨ìˆ˜ëŠ” ì—¬ëŸ¬ ì§‘í•©ì„ ì·¨í•˜ë©° ì£¼ì–´ì§„ ëª¨ë“  ì§‘í•©ì´ ê³µí†µìœ¼ë¡œ ê°€ì§€ê³  ìˆëŠ” ìš”ì†Œë§Œì„ í¬í•¨í•˜ëŠ” ë‹¨ì¼ ì§‘í•©ì„ ìƒì„±í•œë‹¤. ì¦‰, ì§‘í•©ì˜ êµì°¨ì ì„ ê³„ì‚°í•©ë‹ˆë‹¤.

```
setintersection(sets...)
```

##### Examples

```
> setintersection(["a", "b"], ["b", "c"], ["b", "d"])
[
  "b",
]
```

ì£¼ì–´ì§„ ì¸ìˆ˜ëŠ” ì§‘í•©ìœ¼ë¡œ ë³€í™˜ë˜ë¯€ë¡œ ê²°ê³¼ë„ ì§‘í•©ì´ë©° ì£¼ì–´ì§„ ìš”ì†Œì˜ ìˆœì„œê°€ ìœ ì§€ë˜ì§€ ì•ŠìŠµë‹ˆë‹¤.

##### Related Functions

- containsëŠ” ì§€ì •ëœ ëª©ë¡ ë˜ëŠ” ì§‘í•©ì— ì§€ì •ëœ ìš”ì†Œ ê°’ì´ í¬í•¨ë˜ì–´ ìˆëŠ”ì§€ í…ŒìŠ¤íŠ¸í•©ë‹ˆë‹¤.
- set productëŠ” ì—¬ëŸ¬ ì§‘í•©ì˜ ë°ì¹´ë¥´íŠ¸ ê³±ì„ ê³„ì‚°í•©ë‹ˆë‹¤.
- set subtractëŠ” ë‘ ì§‘í•©ì˜ ìƒëŒ€ë³´ìˆ˜ë¥¼ ê³„ì‚°í•œë‹¤.
- set unionì€ ì—¬ëŸ¬ ì§‘í•©ì˜ í•©ì„ ê³„ì‚°í•©ë‹ˆë‹¤.

#### setproduct Function

setproduct í•¨ìˆ˜ëŠ” Cartesian product ë°ì¹´ë¥´íŠ¸ ê³±ì„ ê³„ì‚°í•˜ì—¬ ì£¼ì–´ì§„ ëª¨ë“  ì§‘í•©ì—ì„œ ê°€ëŠ¥í•œ ëª¨ë“  ìš”ì†Œì˜ ì¡°í•©ì„ ì°¾ëŠ”ë‹¤.

```
setproduct(sets...)
```

ì´ í•¨ìˆ˜ëŠ” ì• í”Œë¦¬ì¼€ì´ì…˜ë³„ í™˜ê²½ë³„ ë¦¬ì†ŒìŠ¤ì™€ ê°™ì´ ì—¬ëŸ¬ ì§‘í•©ì˜ ë©¤ë²„ ì¡°í•©ì˜ ì „ì²´ ì§‘í•©ì„ ì°¾ëŠ” ë° íŠ¹íˆ ìœ ìš©í•©ë‹ˆë‹¤.

```
> setproduct(["development", "staging", "production"], ["app1", "app2"])
[
  [
    "development",
    "app1",
  ],
  [
    "development",
    "app2",
  ],
  [
    "staging",
    "app1",
  ],
  [
    "staging",
    "app2",
  ],
  [
    "production",
    "app1",
  ],
  [
    "production",
    "app2",
  ],
]
```

ì´ í•¨ìˆ˜ì— ìµœì†Œ ë‘ ê°œì˜ ì¸ìˆ˜ë¥¼ ì „ë‹¬í•´ì•¼ í•©ë‹ˆë‹¤.

ì´ í•¨ìˆ˜ëŠ” ì£¼ë¡œ ì§‘í•©ì— ëŒ€í•´ ì •ì˜ë˜ì§€ë§Œ ëª©ë¡ì—ë„ ì‚¬ìš©í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤. ì£¼ì–´ì§„ ì¸ìˆ˜ê°€ ëª¨ë‘ ë¦¬ìŠ¤íŠ¸ë¼ë©´ ê²°ê³¼ëŠ” ë¦¬ìŠ¤íŠ¸ì´ë©°, ì£¼ì–´ì§„ ë¦¬ìŠ¤íŠ¸ì˜ ìˆœì„œë¥¼ ìœ ì§€í•œë‹¤. ê·¸ë ‡ì§€ ì•Šìœ¼ë©´ ê²°ê³¼ê°€ ì§‘í•©ì…ë‹ˆë‹¤. ë‘ ê²½ìš° ëª¨ë‘ ê²°ê³¼ì˜ element typeì€ ì£¼ì–´ì§„ ê° ì¸ìˆ˜ì— í•´ë‹¹í•˜ëŠ” ê°’ì˜ listì…ë‹ˆë‹¤.

##### Examples

ìœ„ì— ì´ ê¸°ëŠ¥ì˜ ì¼ë°˜ì ì¸ ì‚¬ìš© ì˜ˆì œê°€ ìˆìŠµë‹ˆë‹¤. hand-writtingí• ë•ŒëŠ” ëœ í”í•˜ì§€ë§Œ ì¬ì‚¬ìš© ê°€ëŠ¥í•œ ëª¨ë“ˆ ìƒí™©ì—ì„œ ë°œìƒí•  ìˆ˜ ìˆëŠ” ëª‡ ê°€ì§€ ë‹¤ë¥¸ ìƒí™©ì´ ìˆë‹¤.

ë§Œì•½ ì–´ë–¤ ì¸ìˆ˜ê°€ ë¹„ì–´ ìˆë‹¤ë©´, ê²°ê³¼ëŠ” í•­ìƒ ë¹„ê²Œ ëœë‹¤:(ì–´ë–¤ ìˆ«ìì— 0ì„ ê³±í•˜ë©´ 0ì´ ë˜ëŠ” ê²ƒê³¼ ë¹„ìŠ·í•˜ê²Œ)

```
> setproduct(["development", "staging", "production"], [])
[]
```

```
> setproduct(["a"], ["b"])
[
  [
    "a",
    "b",
  ],
]
```

ê° ì¸ìˆ˜ì—ëŠ” ëª¨ë“  ìš”ì†Œì— ëŒ€í•´ ì¼ê´€ëœ ìœ í˜•ì´ ìˆì–´ì•¼ í•©ë‹ˆë‹¤. ê·¸ë ‡ì§€ ì•Šìœ¼ë©´ í…Œë¼í¼ì€ ê°€ì¥ ì¼ë°˜ì ì¸ ìœ í˜•ìœ¼ë¡œ ë³€í™˜ì„ ì‹œë„í•˜ê±°ë‚˜, ê·¸ëŸ¬í•œ ë³€í™˜ì´ ë¶ˆê°€ëŠ¥í•  ê²½ìš° ì˜¤ë¥˜ë¥¼ ìƒì„±í•©ë‹ˆë‹¤. ì˜ˆë¥¼ ë“¤ì–´, ë¬¸ìì—´ê³¼ ìˆ«ìë¥¼ ëª¨ë‘ ì„ìœ¼ë©´ ìˆ«ìê°€ ë¬¸ìì—´ë¡œ ë³€í™˜ë˜ì–´ ê²°ê³¼ ìš”ì†Œë“¤ì´ ëª¨ë‘ ì¼ê´€ëœ ìœ í˜•ì„ ê°–ë„ë¡ í•œë‹¤.

```
> setproduct(["staging", "production"], ["a", 2])
[
  [
    "staging",
    "a",
  ],
  [
    "staging",
    "2",
  ],
  [
    "production",
    "a",
  ],
  [
    "production",
    "2",
  ],
]
```

##### Finding combination for for_each

for_each ë¦¬ì†ŒìŠ¤ì™€ dynamic ë¸”ë¡ ì–¸ì–´ ê¸°ëŠ¥ ëª¨ë‘ ê° ë°˜ë³µë§ˆë‹¤ í•œ ìš”ì†Œë¥¼ ê°–ëŠ” collection ê°’ì´ í•„ìš”í•˜ë‹¤.

ë•Œë¡œëŠ” ì…ë ¥ ë°ì´í„°ê°€ for_each ì¸ìˆ˜ì— ì§ì ‘ ì‚¬ìš©í•  ìˆ˜ ì—†ëŠ” ë³„ë„ì˜ ê°’ìœ¼ë¡œ ì œê³µë˜ê¸°ë„ í•˜ë©°, setproductëŠ” ì—¬ëŸ¬ ë‹¤ë¥¸ collectionì—ì„œ ìš”ì†Œì˜ ëª¨ë“  ê³ ìœ í•œ ì¡°í•©ì„ ì°¾ìœ¼ë ¤ëŠ” ìƒí™©ì— ìœ ìš©í•œ ë„ìš°ë¯¸ í•¨ìˆ˜ê°€ ë  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

ì˜ˆë¥¼ ë“¤ì–´ ë‹¤ìŒê³¼ ê°™ì€ ë³€ìˆ˜ë¥¼ ì„ ì–¸í•˜ëŠ” ëª¨ë“ˆì„ ìƒê°í•´ ë³´ì‹­ì‹œì˜¤.

```
variable "networks" {
  type = map(object({
    base_cidr_block = string
  }))
}
variable "subnets" {
  type = map(object({
    number = number
  }))
}
```

ì •ì˜ëœ ê° ë„¤íŠ¸ì›Œí¬ë³„ë¡œ ì •ì˜ëœ ì„œë¸Œë„·ì„ ìƒì„±í•˜ëŠ” ê²ƒì´ ëª©í‘œì¸ ê²½ìš° ìµœìƒìœ„ ë„¤íŠ¸ì›Œí¬ë¥¼ ìƒì„±í•˜ëŠ” ê²ƒì€ ì´ë¯¸ ê²°ê³¼ ì¸ìŠ¤í„´ìŠ¤ê°€ ë§µ ìš”ì†Œì™€ ì¼ëŒ€ì¼ë¡œ ì¼ì¹˜í•˜ëŠ” í˜•íƒœì´ê¸° ë•Œë¬¸ì— var.networksë¥¼ ì§ì ‘ ì‚¬ìš©í•  ìˆ˜ ìˆìŠµë‹ˆë‹¤.

```
resource "aws_vpc" "example" {
  for_each = var.networks
  cidr_block = each.value.base_cidr_block
}
```

ê·¸ëŸ¬ë‚˜ ë‹¨ì¼ ë¦¬ì†ŒìŠ¤ ë¸”ë¡ìœ¼ë¡œ ëª¨ë“  ì„œë¸Œë„·ì„ ì„ ì–¸í•˜ë ¤ë©´ ë¨¼ì € ê° ìš”ì†Œ ìì²´ê°€ ì„œë¸Œë„·ì„ ë‚˜íƒ€ë‚´ë„ë¡ ë„¤íŠ¸ì›Œí¬ ë° ì„œë¸Œë„·ì˜ ëª¨ë“  ì¡°í•©ì„ ë‚˜íƒ€ë‚´ëŠ” ìš”ì†Œë¥¼ ê°€ì§„ ì»¬ë ‰ì…˜ì„ ìƒì„±í•´ì•¼ í•©ë‹ˆë‹¤.

```
locals {
  # setproduct works with sets and lists, but the variables are both maps
  # so convert them first.
  networks = [
    for key, network in var.networks : {
      key        = key
      cidr_block = network.cidr_block
    }
  ]
  subnets = [
    for key, subnet in var.subnets : {
      key    = key
      number = subnet.number
    }
  ]
  network_subnets = [
    # in pair, element zero is a network and element one is a subnet,
    # in all unique combinations.
    for pair in setproduct(local.networks, local.subnets) : {
      network_key = pair[0].key
      subnet_key  = pair[1].key
      network_id  = aws_vpc.example[pair[0].key].id
      # The cidr_block is derived from the corresponding network. Refer to the
      # cidrsubnet function for more information on how this calculation works.
      cidr_block = cidrsubnet(pair[0].cidr_block, 4, pair[1].number)
    }
  ]
}
resource "aws_subnet" "example" {
  # local.network_subnets is a list, so project it into a map
  # where each key is unique. Combine the network and subnet keys to
  # produce a single unique key per instance.
  for_each = {
    for subnet in local.network_subnets : "${subnet.network_key}.${subnet.subnet_key}" => subnet
  }
  vpc_id            = each.value.network_id
  availability_zone = each.value.subnet_key
  cidr_block        = each.value.cidr_block
}
```

ìœ„ì˜ ì˜ˆì—ì„œ network_subnets ëª©ë¡ì€ input ë³€ìˆ˜ì˜ ë„¤íŠ¸ì›Œí¬ì™€ ì„œë¸Œë„· ìš”ì†Œì˜ ì¡°í•©ë‹¹ í•˜ë‚˜ì˜ ì„œë¸Œë„· ì¸ìŠ¤í„´ìŠ¤ë¥¼ ìƒì„±í•©ë‹ˆë‹¤. ì´ ì˜ˆì œ ì…ë ¥ì˜ ê²½ìš°:

```
networks = {
  a = {
    base_cidr_block = "10.1.0.0/16"
  }
  b = {
    base_cidr_block = "10.2.0.0/16"
  }
}
subnets = {
  a = {
    number = 1
  }
  b = {
    number = 2
  }
  c = {
    number = 3
  }
}
```

nework_subnetsì˜ outputì€ ë‹¤ìŒê³¼ ìœ ì‚¬í•©ë‹ˆë‹¤.

```
[
  {
    "cidr_block" = "10.1.16.0/20"
    "network_id" = "vpc-0bfb00ca6173ea5aa"
    "network_key" = "a"
    "subnet_key" = "a"
  },
  {
    "cidr_block" = "10.1.32.0/20"
    "network_id" = "vpc-0bfb00ca6173ea5aa"
    "network_key" = "a"
    "subnet_key" = "b"
  },
  {
    "cidr_block" = "10.1.48.0/20"
    "network_id" = "vpc-0bfb00ca6173ea5aa"
    "network_key" = "a"
    "subnet_key" = "c"
  },
  {
    "cidr_block" = "10.2.16.0/20"
    "network_id" = "vpc-0d193e011f6211a7d"
    "network_key" = "b"
    "subnet_key" = "a"
  },
  {
    "cidr_block" = "10.2.32.0/20"
    "network_id" = "vpc-0d193e011f6211a7d"
    "network_key" = "b"
    "subnet_key" = "b"
  },
  {
    "cidr_block" = "10.2.48.0/20"
    "network_id" = "vpc-0d193e011f6211a7d"
    "network_key" = "b"
    "subnet_key" = "c"
  },
]
```

##### Related Functions

- containsëŠ” ì§€ì •ëœ ëª©ë¡ ë˜ëŠ” ì§‘í•©ì— ì§€ì •ëœ ìš”ì†Œ ê°’ì´ í¬í•¨ë˜ì–´ ìˆëŠ”ì§€ í…ŒìŠ¤íŠ¸í•©ë‹ˆë‹¤.
- flattenì€ ë‘ ê°œì²´ ìœ í˜• ê°„ì˜ ê´€ê³„ê°€ ëª…ì‹œì ìœ¼ë¡œ ì •ì˜ëœ ìƒí™©ì—ì„œ ê³„ì¸µì  ë°ì´í„°ë¥¼ ë‹¨ì¼ ëª©ë¡ìœ¼ë¡œ í”Œë«í™”í•˜ëŠ” ë° ìœ ìš©í•©ë‹ˆë‹¤.
- set intersectionì€ ì—¬ëŸ¬ ì§‘í•©ì˜ êµì°¨ì ì„ ê³„ì‚°í•©ë‹ˆë‹¤.
- set subtractëŠ” ë‘ ì§‘í•©ì˜ ìƒëŒ€ë³´ìˆ˜ë¥¼ ê³„ì‚°í•œë‹¤.
- set unionì€ ì—¬ëŸ¬ ì§‘í•©ì˜ í•©ì„ ê³„ì‚°í•©ë‹ˆë‹¤.

#### setsubtract Function

setsubtract í•¨ìˆ˜ëŠ” ë‘ ë²ˆì§¸ ì§‘í•©ì— ì—†ëŠ” ì²« ë²ˆì§¸ ì§‘í•©ì˜ ìš”ì†Œë¥¼ í¬í•¨í•˜ëŠ” ìƒˆ ì§‘í•©ì„ ë°˜í™˜í•©ë‹ˆë‹¤. ì¦‰, ë‘ ë²ˆì§¸ ì§‘í•©ì˜ relative complement(ìƒëŒ€ì ì¸ ë³´ì™„ìš”ì†Œ)ë¥¼ ê³„ì‚°í•©ë‹ˆë‹¤.

```
setsubtract(a, b)
```

##### Examples

```
> setsubtract(["a", "b", "c"], ["a", "c"])
[
  "b",
]
```

##### ##### ##### Set Difference (Symmetric Difference)

```
> setunion(setsubtract(["a", "b", "c"], ["a", "c", "d"]), setsubtract(["a", "c", "d"], ["a", "b", "c"]))
[
  "b",
  "d",
]
```

##### Related Functions

- setintersectionì€ ì—¬ëŸ¬ ì§‘í•©ì˜ êµì°¨ì ì„ ê³„ì‚°í•©ë‹ˆë‹¤.
- setproductëŠ” ì—¬ëŸ¬ ì§‘í•©ì˜ ë°ì¹´ë¥´íŠ¸ ê³±ì„ ê³„ì‚°í•©ë‹ˆë‹¤.
- setunionì€ ì—¬ëŸ¬ ì§‘í•©ì˜ í•©ì„ ê³„ì‚°í•©ë‹ˆë‹¤.

#### setunion Function

setunion í•¨ìˆ˜ëŠ” ì—¬ëŸ¬ ì§‘í•©ì„ ì·¨í•˜ë©° ì£¼ì–´ì§„ ëª¨ë“  ì§‘í•©ì˜ ì›ì†Œë¥¼ í¬í•¨í•˜ëŠ” ë‹¨ì¼ ì§‘í•©ì„ ìƒì„±í•œë‹¤. ì¦‰, ì§‘í•©ì˜ í•©ì„ ê³„ì‚°í•©ë‹ˆë‹¤.

```
setunion(sets...)
```

##### Examples

```
> setunion(["a", "b"], ["b", "c"], ["d"])
[
  "d",
  "b",
  "c",
  "a",
]
```

ì£¼ì–´ì§„ ì¸ìˆ˜ëŠ” ì§‘í•©ìœ¼ë¡œ ë³€í™˜ë˜ë¯€ë¡œ ê²°ê³¼ë„ ì§‘í•©ì´ë©° ì£¼ì–´ì§„ ìš”ì†Œì˜ ìˆœì„œê°€ ìœ ì§€ë˜ì§€ ì•ŠìŠµë‹ˆë‹¤.

##### Related Functions

- containsëŠ” ì§€ì •ëœ ëª©ë¡ ë˜ëŠ” ì§‘í•©ì— ì§€ì •ëœ ìš”ì†Œ ê°’ì´ í¬í•¨ë˜ì–´ ìˆëŠ”ì§€ í…ŒìŠ¤íŠ¸í•©ë‹ˆë‹¤.
- setintersectionì€ ì—¬ëŸ¬ ì§‘í•©ì˜ êµì°¨ì ì„ ê³„ì‚°í•©ë‹ˆë‹¤.
- setproductëŠ” ì—¬ëŸ¬ ì§‘í•©ì˜ ë°ì¹´ë¥´íŠ¸ ê³±ì„ ê³„ì‚°í•©ë‹ˆë‹¤.
- setsubtractëŠ” ë‘ ì§‘í•©ì˜ ìƒëŒ€ë³´ìˆ˜ë¥¼ ê³„ì‚°í•œë‹¤.

#### slice Function

sliceëŠ” ëª©ë¡ ë‚´ì—ì„œ ëª‡ ê°€ì§€ ì—°ì† ìš”ì†Œë¥¼ ì¶”ì¶œí•©ë‹ˆë‹¤.

```
slice(list, startindex, endindex)
```

startindexëŠ” inclusive(í¬í•¨)ì´ê³  endindexëŠ” exclusive(ì œì™¸)ì…ë‹ˆë‹¤. ì´ í•¨ìˆ˜ëŠ” ë‘ ì¸ë±ìŠ¤ ì¤‘ í•˜ë‚˜ê°€ ì§€ì •ëœ ëª©ë¡ì— ëŒ€í•œ ìœ íš¨í•œ ì¸ë±ìŠ¤ ë²”ìœ„ë¥¼ ë²—ì–´ë‚˜ëŠ” ê²½ìš° ì˜¤ë¥˜ë¥¼ ë°˜í™˜í•©ë‹ˆë‹¤.

##### Examples

```
> slice(["a", "b", "c", "d"], 1, 3)
[
  "b",
  "c",
]
```

##### Related Functions

- substrì€ ë¬¸ìì—´ì˜ ë¬¸ìì— ëŒ€í•´ ë¹„ìŠ·í•œ ê¸°ëŠ¥ì„ ìˆ˜í–‰í•˜ì§€ë§Œ, ë ìƒ‰ì¸ ëŒ€ì‹  ê¸¸ì´ë¥¼ ì‚¬ìš©í•œë‹¤.

#### sort Function

sortëŠ” ë¬¸ìì—´ ëª©ë¡ì„ ê°€ì ¸ì™€ì„œ í•´ë‹¹ ë¬¸ìì—´ì´ ì‚¬ì „ìˆœìœ¼ë¡œ ì •ë ¬ëœ ìƒˆ ëª©ë¡ì„ ë°˜í™˜í•©ë‹ˆë‹¤.

sortëŠ” ìœ ë‹ˆì½”ë“œ ì½”ë“œ í¬ì¸íŠ¸ì˜ ê´€ì ì—ì„œ ì´ë£¨ì–´ì§€ë©°, ê²°ê³¼ì—ì„œ ë‚®ì€ ì½”ë“œ í¬ì¸íŠ¸ ë’¤ì— ë” ë†’ì€ ì½”ë“œ í¬ì¸íŠ¸ê°€ ë‚˜íƒ€ë‚œë‹¤.

##### Examples

```
> sort(["e", "d", "a", "x"])
[
  "a",
  "d",
  "e",
  "x",
]
```

#### sum Function

sumì€ ëª©ë¡ ë˜ëŠ” ìˆ«ì ì§‘í•©ì„ ì·¨í•˜ì—¬ í•´ë‹¹ ìˆ«ìì˜ í•©ì„ ë°˜í™˜í•©ë‹ˆë‹¤.

##### Examples

```
> sum([10, 13, 6, 4.5])
33.5
```

#### transpose Function

transposeëŠ” ë¬¸ìì—´ ëª©ë¡ì˜ ë§µì„ ê°€ì ¸ì™€ì„œ í‚¤ì™€ ê°’ì„ êµí™˜í•˜ì—¬ ë¬¸ìì—´ ëª©ë¡ì˜ ìƒˆ ë§µì„ ìƒì„±í•©ë‹ˆë‹¤.

##### Examples

```
> transpose({"a" = ["1", "2"], "b" = ["2", "3"]})
{
  "1" = [
    "a",
  ],
  "2" = [
    "a",
    "b",
  ],
  "3" = [
    "b",
  ],
}
```

#### values Function

valuesëŠ” ë§µì„ ê°€ì ¸ì™€ì„œ í•´ë‹¹ ë§µì˜ elements ê°’ì„ í¬í•¨í•˜ëŠ” ëª©ë¡ì„ ë°˜í™˜í•©ë‹ˆë‹¤.

ê°’ì€ í•´ë‹¹ í‚¤ì— ì˜í•´ ì‚¬ì „ìˆœìœ¼ë¡œ ë°˜í™˜ë˜ë¯€ë¡œ í‚¤ì—ì„œ ë°˜í™˜ë˜ëŠ” ê²ƒê³¼ ë™ì¼í•œ ìˆœì„œë¡œ ë°˜í™˜ë©ë‹ˆë‹¤.

##### Examples

```
> values({a=3, c=2, d=1})
[
  3,
  2,
  1,
]
```

##### Related Functions

- keysëŠ” ë§µì—ì„œ í‚¤ ëª©ë¡ì„ ë°˜í™˜í•©ë‹ˆë‹¤.

#### zipmap Function

zipmapì€ í‚¤ ëª©ë¡ê³¼ ê·¸ì— ìƒì‘í•˜ëŠ” ê°’ ëª©ë¡ìœ¼ë¡œ ë§µì„ êµ¬ì„±í•œë‹¤.

```
zipmap(keyslist, valueslist)
```

keylistì™€ valuelistëŠ” ê¸¸ì´ê°€ ê°™ì•„ì•¼ í•©ë‹ˆë‹¤. keyslistëŠ” ë¬¸ìì—´ ëª©ë¡ì´ì–´ì•¼ í•˜ë©°, valueslistëŠ” ëª¨ë“  ìœ í˜•ì˜ ëª©ë¡ì¼ ìˆ˜ ìˆìŠµë‹ˆë‹¤.

ë‘ ëª©ë¡ì—ì„œ ë™ì¼í•œ ì¸ë±ìŠ¤ë¥¼ ê°€ì§„ ê° element pairëŠ” ê²°ê³¼ ë§µì—ì„œ elementì˜ keyì™€ valueë¡œ ì‚¬ìš©ë©ë‹ˆë‹¤. keylistì— ë™ì¼í•œ ê°’ì´ ì—¬ëŸ¬ ë²ˆ ë‚˜íƒ€ë‚˜ë©´ ê°€ì¥ ë†’ì€ ì¸ë±ìŠ¤ë¥¼ ê°€ì§„ ê°’ì´ ê²°ê³¼ ë§µì— ì‚¬ìš©ë©ë‹ˆë‹¤.

##### Examples

```
> zipmap(["a", "b"], [1, 2])
{
  "a" = 1
  "b" = 2
}
```

---

### [ì´ì „ í˜ì´ì§€](https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/02_String_Functions/README.md)

### [ë‹¤ìŒ í˜ì´ì§€](https://github.com/YGCHO-repo/Terraform/blob/main/DOCS/08_Functions/04_Encoding_Functions/README.md)

### [HOME](https://github.com/YGCHO-repo/Terraform/blob/main/README.md)
